#ifndef __MAIN_H
#define __MAIN_H


#ifdef MAIN_GLOBALS
	#define	MAIN_EXT
#else
	#define	MAIN_EXT	extern
#endif


/************************************************************************/
/* 定义软件版本号                                                       */
/************************************************************************/
#define		VERSION_H	1		//	1-99
#define		VERSION_M	0		//	1-99	
#define		VERSION_L	0		//	0-99


/************************************************************************/
/* 定义是否进入调试模式                                                 */
/************************************************************************/
#define DEBUG 1


#include "print.h"

	
#endif
